microproyecto-1/artillery-tests/load.yml
config:
  target: "http://192.168.100.8" # HAProxy VM
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Carga baja"
    - duration: 30
      arrivalRate: 20
      name: "Carga media"
  defaults:
    headers:
      User-Agent: "artillery"

scenarios:
  - name: "GET /"
    flow:
      - get:
          url: "/"